; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation4 - direction
	Star6 - direction
	Star3 - direction
	Star7 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Star8 - direction
	GroundStation2 - direction
	Star0 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 spectrograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
)
(:goal (and
	(have_image Planet9 image0)
	(have_image Planet10 spectrograph1)
	(have_image Star11 image0)
	(have_image Star12 image0)
	(have_image Phenomenon13 image0)
	(have_image Planet14 spectrograph1)
	(have_image Phenomenon15 image0)
	(have_image Phenomenon16 image0)
	(have_image Phenomenon17 image0)
))

)

; plan
1. (turn_to satellite0 groundstation1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 phenomenon16 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 9
5. (take_image satellite0 phenomenon16 instrument0 image0)
   added: (have_image phenomenon16 image0)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon15 instrument0 image0)
   added: (have_image phenomenon15 image0)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon13 instrument0 image0)
   added: (have_image phenomenon13 image0)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon17 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon17 instrument0 image0)
   added: (have_image phenomenon17 image0)
   goals met: 4 of 9
12. (turn_to satellite0 planet10 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet10)
   goals met: 4 of 9
13. (take_image satellite0 planet10 instrument0 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 5 of 9
14. (turn_to satellite0 planet14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet14)
   goals met: 5 of 9
15. (take_image satellite0 planet14 instrument0 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 6 of 9
16. (turn_to satellite0 planet9 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet9)
   goals met: 6 of 9
17. (take_image satellite0 planet9 instrument0 image0)
   added: (have_image planet9 image0)
   goals met: 7 of 9
18. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 7 of 9
19. (take_image satellite0 star11 instrument0 image0)
   added: (have_image star11 image0)
   goals met: 8 of 9
20. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 8 of 9
21. (take_image satellite0 star12 instrument0 image0)
   added: (have_image star12 image0)
   goals met: 9 of 9
